#
#   ____                     __ _ _
#  | __ ) _ __ _____      __/ _(_) | ___
#  |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
#  | |_) | | |  __/\ V  V /|  _| | |  __/
#  |____/|_|  \___| \_/\_/ |_| |_|_|\___|
#
#
# Jesper Madsen
# type: brew bundle

cask_args appdir: '/Applications'
tap 'homebrew/core'
tap 'caskroom/cask'
tap 'shopify/shopify'

brew 'wget'

#  Cask
# 'caskroom/cask/brew-cask'

#  Casks

# Development
cask 'java'
cask 'virtualbox'
cask 'vagrant'
cask 'iterm2'
cask 'visual-studio-code'
cask 'sequel-pro'
cask 'postman'
cask 'sourcetree'
brew 'node'
brew 'awscli'
cask 'gitup'

# Web Development
brew 'composer'
brew 'yarn'
brew 'themekit' # shopify themekit

# command line
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'mas'

# applications
cask 'slack'
cask 'vlc'
cask 'teamviewer'
cask 'spotify'
cask 'google-chrome'
cask 'dropbox'

# App Store applications
mas 'Xcode', id: 497799835
mas 'Trello', id: 1278508951
mas 'GIPHY Capture', id: 668208984
mas 'CopyClip', id: 595191960
