#
#   ____                     __ _ _
#  | __ ) _ __ _____      __/ _(_) | ___
#  |  _ \| '__/ _ \ \ /\ / / |_| | |/ _ \
#  | |_) | | |  __/\ V  V /|  _| | |  __/
#  |____/|_|  \___| \_/\_/ |_| |_|_|\___|
#
#
# Mads Møller
# type: brew bundle

cask_args appdir: '/Applications'
tap 'homebrew/core'
tap 'caskroom/cask'

brew 'wget'

#  Cask
# 'caskroom/cask/brew-cask'

#  Casks

# Development
cask 'java'
cask 'virtualbox'
cask 'vagrant'
cask 'iterm2'
cask 'visual-studio-code'
cask 'sequel-pro'
cask 'postman'
cask 'sourcetree'
brew 'node'
brew 'awscli'

# Web Development
brew 'composer'
brew 'yarn'

# command line
brew 'zsh'
brew 'zsh-syntax-highlighting'
brew 'zsh-completions'
brew 'mas'

# applications
cask 'slack'
cask 'teamviewer'
cask 'spotify'
cask 'google-chrome'
cask 'dropbox'

# Fonts
tap 'caskroom/fonts'
cask 'font-devicons'
cask 'font-fontawesome'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-roboto'
